Config/Catalogs/RegularOperationGroups.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>RegularOperationGroups</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>RegularOperations</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>RoomType</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.RoomTypes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RoomRate</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.RoomRates</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RegularOperation</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Operations</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>RegularOperationFrequency</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PerformOnCheckInDay</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PerformOnCheckOutDay</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PerformWhenRoomIsBusy</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PerformWhenRoomIsFree</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>DoNotPerformOnWeekends</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IsPerGuest</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Catalogs/RegularOperationGroups/Forms/tcItemForm/Ext/Form/Module.bsl
#Region FormEventHandlers

// -----------------------------------------------------------------------------
&AtServer
Procedure OnCreateAtServer(pCancel, pStandardProcessing)
	// Check user rights to edit item
	If Not cmCheckUserPermissions("HavePermissionToManageHousekeeping") Then
		If Not ValueIsFilled(Object.Ref) Then
			pCancel = True;
			tcCommonFunctionOnClientServer.TextMessage(NStr("en='You do not have rights to edit housekeeping settings!';ru='Нет прав на управление службой горничных!';de='Sie haben keine Rechte, die Einstellungen des Reinigungsdienstes zu verwalten!'"));
			Return;
		Else
			ThisForm.ReadOnly = True;
		EndIf;
	EndIf;
	// Initialize hotel
	tcOnServer.cmInitHotel(Object);
EndProcedure

// -----------------------------------------------------------------------------
&AtClient
Procedure BeforeWrite(pCancel, pWriteParameters)
	For Each vRow In Object.RegularOperations Do
		If Not ValueIsFilled(vRow.RegularOperation) Then
			ShowMessageBox(, NStr("en='Regular operation is not set in line " + vRow.LineNumber + "!'; de='Der reguläre Betrieb ist nicht in Zeile gesetzt (" + vRow.LineNumber + ")!'; ru='В строке " + vRow.LineNumber + " не указана регламентная работа!'"));
			pCancel = True;
			Return;
		EndIf;
		If vRow.RegularOperationFrequency = 0 Then
			ShowMessageBox(, NStr("en='Regular operation periodicity is not set in line " + vRow.LineNumber + "!'; de='Der reguläre Betrieb Periodizität ist nicht in Zeile gesetzt (" + vRow.LineNumber + ")!'; ru='В строке " + vRow.LineNumber + " не указана периодичность выполнения регламентной работы!'"));
			pCancel = True;
			Return;
		EndIf;
	EndDo;
EndProcedure // BeforeWrite



#EndRegion               

#Region FormHeaderItemsEventHandlers

// -----------------------------------------------------------------------------
&AtClient
Procedure RegularOperationsRegularOperationOnChange(pItem)
	vCurRow = Items.RegularOperations.CurrentData;
	If vCurRow <> Undefined Then
		If ValueIsFilled(vCurRow.RegularOperation) Then
			vCurRow.PerformWhenRoomIsBusy = tcOnServer.cmGetAttributeByRef(vCurRow.RegularOperation, "IsRegularCleaning");
			vCurRow.IsPerGuest = tcOnServer.cmGetAttributeByRef(vCurRow.RegularOperation, "IsPerGuest");
		EndIf;
	EndIf;
EndProcedure // RegularOperationsRegularOperationOnChange

#EndRegion
